#pragma warning disable
namespace OYMLCN.WeChat.Enum
{

    ///// <summary>
    ///// 公众号返回码（JSON）
    ///// 应该更名为ReturnCode_MP，但为减少项目中的修改，此处依旧用ReturnCode命名
    ///// </summary>
    //public enum ReturnCode
    //{
    //    系统繁忙此时请开发者稍候再试 = -1,
    //    请求成功 = 0,
    //    获取access_token时AppSecret错误或者access_token无效 = 40001,
    //    不合法的凭证类型 = 40002,
    //    不合法的OpenID = 40003,
    //    不合法的媒体文件类型 = 40004,
    //    不合法的文件类型 = 40005,
    //    不合法的文件大小 = 40006,
    //    不合法的媒体文件id = 40007,
    //    不合法的消息类型 = 40008,
    //    不合法的图片文件大小 = 40009,
    //    不合法的语音文件大小 = 40010,
    //    不合法的视频文件大小 = 40011,
    //    不合法的缩略图文件大小 = 40012,
    //    不合法的APPID = 40013,
    //    不合法的access_token = 40014,
    //    不合法的菜单类型 = 40015,
    //    不合法的按钮个数1 = 40016,
    //    不合法的按钮个数2 = 40017,
    //    不合法的按钮名字长度 = 40018,
    //    不合法的按钮KEY长度 = 40019,
    //    不合法的按钮URL长度 = 40020,
    //    不合法的菜单版本号 = 40021,
    //    不合法的子菜单级数 = 40022,
    //    不合法的子菜单按钮个数 = 40023,
    //    不合法的子菜单按钮类型 = 40024,
    //    不合法的子菜单按钮名字长度 = 40025,
    //    不合法的子菜单按钮KEY长度 = 40026,
    //    不合法的子菜单按钮URL长度 = 40027,
    //    不合法的自定义菜单使用用户 = 40028,
    //    不合法的oauth_code = 40029,
    //    不合法的refresh_token = 40030,
    //    不合法的openid列表 = 40031,
    //    不合法的openid列表长度 = 40032,
    //    不合法的请求字符不能包含uxxxx格式的字符 = 40033,
    //    不合法的参数 = 40035,

    //    //小程序、 公众号都有
    //    template_id不正确 = 40037,

    //    不合法的请求格式 = 40038,
    //    不合法的URL长度 = 40039,
    //    不合法的分组id = 40050,
    //    分组名字不合法 = 40051,
    //    缺少access_token参数 = 41001,
    //    缺少appid参数 = 41002,
    //    缺少refresh_token参数 = 41003,
    //    缺少secret参数 = 41004,
    //    缺少多媒体文件数据 = 41005,
    //    缺少media_id参数 = 41006,
    //    缺少子菜单数据 = 41007,
    //    缺少oauth_code = 41008,
    //    缺少openid = 41009,

    //    //小程序
    //    form_id不正确_或者过期 = 41028,
    //    form_id已被使用 = 41029,
    //    page不正确 = 41030,

    //    access_token超时 = 42001,
    //    refresh_token超时 = 42002,
    //    oauth_code超时 = 42003,
    //    需要GET请求 = 43001,
    //    需要POST请求 = 43002,
    //    需要HTTPS请求 = 43003,
    //    需要接收者关注 = 43004,
    //    需要好友关系 = 43005,
    //    多媒体文件为空 = 44001,
    //    POST的数据包为空 = 44002,
    //    图文消息内容为空 = 44003,
    //    文本消息内容为空 = 44004,
    //    多媒体文件大小超过限制 = 45001,
    //    消息内容超过限制 = 45002,
    //    标题字段超过限制 = 45003,
    //    描述字段超过限制 = 45004,
    //    链接字段超过限制 = 45005,
    //    图片链接字段超过限制 = 45006,
    //    语音播放时间超过限制 = 45007,
    //    图文消息超过限制 = 45008,
    //    接口调用超过限制 = 45009,
    //    创建菜单个数超过限制 = 45010,
    //    回复时间超过限制 = 45015,
    //    系统分组不允许修改 = 45016,
    //    分组名字过长 = 45017,
    //    分组数量超过上限 = 45018,
    //    不存在媒体数据 = 46001,
    //    不存在的菜单版本 = 46002,
    //    不存在的菜单数据 = 46003,
    //    解析JSON_XML内容错误 = 47001,
    //    api功能未授权 = 48001,
    //    用户未授权该api = 50001,
    //    参数错误invalid_parameter = 61451,
    //    无效客服账号invalid_kf_account = 61452,
    //    客服帐号已存在kf_account_exsited = 61453,
    //    /// <summary>
    //    /// 客服帐号名长度超过限制(仅允许10个英文字符，不包括@及@后的公众号的微信号)(invalid kf_acount length)
    //    /// </summary>
    //    客服帐号名长度超过限制 = 61454,
    //    /// <summary>
    //    /// 客服帐号名包含非法字符(仅允许英文+数字)(illegal character in kf_account)
    //    /// </summary>
    //    客服帐号名包含非法字符 = 61455,
    //    /// <summary>
    //    ///  	客服帐号个数超过限制(10个客服账号)(kf_account count exceeded)
    //    /// </summary>
    //    客服帐号个数超过限制 = 61456,
    //    无效头像文件类型invalid_file_type = 61457,
    //    系统错误system_error = 61450,
    //    日期格式错误 = 61500,
    //    日期范围错误 = 61501,


    //    API不可用_即没有开通或升级到新客服功能 = 65400,
    //    无效客服帐号 = 65401,
    //    客服昵称不合法 = 65403,
    //    客服帐号不合法 = 65404,
    //    帐号数目已达到上限_不能继续添加 = 65405,
    //    已经存在的客服帐号 = 65406,
    //    邀请对象已经是本公众号客服 = 65407,
    //    本公众号已发送邀请给该微信号 = 65408,
    //    无效的微信号 = 65409,
    //    邀请对象绑定公众号客服数量达到上限_目前每个微信号最多可以绑定5个公众号客服帐号 = 65410,
    //    该帐号已经有一个等待确认的邀请_不能重复邀请 = 65411,
    //    该帐号已经绑定微信号_不能进行邀请 = 65412,
    //    不存在对应用户的会话信息 = 65413,
    //    客户正在被其他客服接待 = 65414,
    //    指定的客服不在线 = 65415,
    //    查询参数不合法 = 65416,
    //    查询时间段超出限制 = 65417,
    //}


    /// <summary>
    /// 行业代码
    /// </summary>
    public enum IndustryCode
    {
        IT科技_互联网_电子商务 = 1,
        IT科技_IT软件与服务 = 2,
        IT科技_IT硬件与设备 = 3,
        IT科技_电子技术 = 4,
        IT科技_通信与运营商 = 5,
        IT科技_网络游戏 = 6,
        金融业_银行 = 7,
        金融业_基金_理财_信托 = 8,
        金融业_保险 = 9,
        餐饮_餐饮 = 10,
        酒店旅游_酒店 = 11,
        酒店旅游_旅游 = 12,
        运输与仓储_快递 = 13,
        运输与仓储_物流 = 14,
        运输与仓储_仓储 = 15,
        教育_培训 = 16,
        教育_院校 = 17,
        政府与公共事业_学术科研 = 18,
        政府与公共事业_交警 = 19,
        政府与公共事业_博物馆 = 20,
        政府与公共事业_公共事业_非盈利机构 = 21,
        医药护理_医药医疗 = 22,
        医药护理_护理美容 = 23,
        医药护理_保健与卫生 = 24,
        交通工具_汽车相关 = 25,
        交通工具_摩托车相关 = 26,
        交通工具_火车相关 = 27,
        交通工具_飞机相关 = 28,
        房地产_建筑 = 29,
        房地产_物业 = 30,
        消费品_消费品 = 31,
        商业服务_法律 = 32,
        商业服务_会展 = 33,
        商业服务_中介服务 = 34,
        商业服务_认证 = 35,
        商业服务_审计 = 36,
        文体娱乐_传媒 = 37,
        文体娱乐_体育 = 38,
        文体娱乐_娱乐休闲 = 39,
        印刷_印刷 = 40,
        其它_其它 = 41
    }


    /// <summary>
    /// 群发消息返回状态
    /// </summary>
    public enum MassStatus
    {
        正常 = 0,
        涉嫌广告 = 10001,
        涉嫌政治 = 20001,
        涉嫌社会 = 20004,
        涉嫌色情 = 20002,
        涉嫌违法犯罪 = 20006,
        涉嫌欺诈 = 20008,
        涉嫌版权 = 20013,
        涉嫌互推 = 22000,
        涉嫌其他 = 21000,

        原创校验出现系统错误且用户选择了被判为转载就不群发 = 30001,
        原创校验被判定为不能群发 = 30002,
        原创校验被判定为转载文且用户选择了被判为转载就不群发 = 30003
    }



    public enum MassCheckState
    {
        未被判为转载_可以群发 = 1,
        被判为转载_可以群发 = 2,
        被判为转载_不能群发 = 3
    }


}
